# git config --global user.name "HalyshAnton"
# git config --global user.email "ваша_пошта@example.com"

# проект == репозиторій(на github)


# якась зміна


# зміни які не підтверджені
# зміни треба піддтверлити(добавити в індекси)

# побачити статус усіх змін
# git status

# підвердити зміни у файлі
# git add file
# git add .  # обавити всі зміни в усіх файлах

# об'єднуємо зміни в один "версія" і добавляємо повідомлення з поясненням
# git commit -m "повідомлення"

# відправити коміти на гітхаб
# git push

# створити папку
# mkdir folder

# перейти в папку
# cd folder
# cd ..  # повернутись в попередню папку